src/Documents/РассылкаКлиентам/РассылкаКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РассылкаКлиентам</name>
  <basedOn>Catalog.МаркетинговыеМероприятия</basedOn>
  <basedOn>Document.НазначениеОпросов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаРассылки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>DocumentRef.НазначениеОпросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРассылокИОповещений</name>
    <type>
      <types>CatalogRef.ГруппыРассылокИОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредназначенаДляЭлектронныхПисем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредназначенаДляSMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстSMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборАдресатов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекстаПисьма</name>
    <type>
      <types>EnumRef.СпособыРедактированияЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРассылокКлиентам</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьВТранслите</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучатели</name>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактнаяИнформация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/СпособыРедактированияЭлектронныхПисем/СпособыРедактированияЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРедактированияЭлектронныхПисем</name>
  <enumValues>
    <name>ОбычныйТекст</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыРассылокКлиентам/СтатусыРассылокКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРассылокКлиентам</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>КОтправке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
</mdclass:Enum>

src/Documents/РассылкаКлиентам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ПредназначенаДляSMS Тогда
		
		ТипТекстаПисьма =  Неопределено;
		ТекстПисьма     = "";
		ТекстПисьмаHTML = ""; 
		
	Иначе
		
		ТекстSMS = "";
		ОтправлятьВТранслите = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ПредназначенаДляЭлектронныхПисем Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ТекстSMS");
		
		Если ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ТекстПисьма");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПредназначенаДляSMS Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ТипТекстаПисьма");
		МассивНепроверяемыхРеквизитов.Добавить("ТекстПисьма");
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	Если ДатаАктуальности <> Дата(1, 1, 1) 
		И (Статус = Перечисления.СтатусыРассылокКлиентам.Черновик ИЛИ Статус = Перечисления.СтатусыРассылокКлиентам.КОтправке) Тогда
		
		Если ДатаАктуальности < ТекущаяДатаСеанса() Тогда
			
			ТекстСообщения= НСтр("ru='Указанная дата актуальности меньше текущей даты, сообщения никогда не будут отправлены.';uk='Зазначена дата актуальності менше поточної дати, повідомлення не буде надіслане.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ДатаАктуальности",,Отказ);
			
		КонецЕсли;
		
		Если ДатаАктуальности < ДатаРассылки Тогда
			
			ТекстСообщения= НСтр("ru='Указанная дата актуальности меньше даты рассылки, сообщения никогда не будут отправлены.';uk='Зазначена дата актуальності менше дати розсилки, повідомлення не буде надіслане.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ДатаАктуальности",,Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого ДополнительныйПолучатель Из ДополнительныеПолучатели Цикл
	
		Если ПустаяСтрока(ДополнительныйПолучатель.КонтактнаяИнформация) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтроки = ДополнительныйПолучатель.НомерСтроки;
		
		ПутьКТабличнойЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.ДополнительныеПолучатели",
		                                                                       ДополнительныйПолучатель.НомерСтроки,
		                                                                      "КонтактнаяИнформация");
		
		Если ПредназначенаДляSMS Тогда
		
			Если СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДополнительныйПолучатель.КонтактнаяИнформация, ";", Истина).Количество() > 1 Тогда
			
				ТекстСообщения = НСтр("ru='В строке %1 указан более чем один номер телефона.';uk='У рядку %1 вказано більше ніж один номер телефону.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщения, НомерСтроки);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				       ТекстСообщения,
				       ,
				      ПутьКТабличнойЧасти,
				      ,
				      Отказ);
				Продолжить;
				
			КонецЕсли;
			
			ТекстСообщения = НСтр("ru='Номер телефона в строке %1 должен быть указан в формате ""+xx (xxx) xxxxxxx"".';uk='Номер телефону в рядку %1 повинен бути вказаний у форматі ""+xx (xxx) xxxxxxx"".'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомерСтроки);
			
			СтруктураПолей = ВзаимодействияКлиентСервер.СтруктураПолейПоПредставлениюТелефона(ДополнительныйПолучатель.КонтактнаяИнформация);
			Если Не ВзаимодействияКлиентСервер.КорректноВведенНомерТелефона(СтруктураПолей) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				      ТекстСообщения,
				      ,
				      ПутьКТабличнойЧасти,
				      ,
				      Отказ);
				
			КонецЕсли;
			
		Иначе
			
			МассивАдресов = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(ДополнительныйПолучатель.КонтактнаяИнформация);
			
			Если МассивАдресов.Количество() > 1 Тогда
				
				ТекстСообщения = НСтр("ru='В строке %1 указан более чем один адрес электронной почты.';uk='У рядку %1 вказано більше ніж один адресу електронної пошти.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомерСтроки);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				       ТекстСообщения,
				       ,
				       ПутьКТабличнойЧасти,
				       ,
				       Отказ);
				Продолжить;
				
			КонецЕсли;
			
			Если МассивАдресов.Количество() = 1 И Не ПустаяСтрока(МассивАдресов[0].ОписаниеОшибки) Тогда
				
				ТекстСообщения = НСтр("ru='Ошибка в строке %1. %2';uk='Помилка в рядку %1. %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомерСтроки, МассивАдресов[0].ОписаниеОшибки);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,
					,
					ПутьКТабличнойЧасти,
					,
					Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.МаркетинговыеМероприятия") Тогда
		
		Основание = ДанныеЗаполнения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НазначениеОпросов") Тогда
		
		Основание = ДанныеЗаполнения;
		РеквизитыОпроса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Наименование, Дата, ДатаНачала, ДатаОкончания");
		Тема      = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Рассылка по опросу ""%1"" от %2.';uk='Розсилка за опитуванням ""%1"" від %2.'"),
		                                                                    РеквизитыОпроса.Наименование, РеквизитыОпроса.Дата);
		
		ДатаРассылки     = ?(ЗначениеЗаполнено(РеквизитыОпроса.ДатаНачала), НачалоДня(РеквизитыОпроса.ДатаНачала), Дата(1, 1, 1));
		ДатаАктуальности = ?(ЗначениеЗаполнено(РеквизитыОпроса.ДатаОкончания), КонецДня(РеквизитыОпроса.ДатаОкончания), Дата(1, 1, 1));
		
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	ДатаРассылки  = ?(ДатаРассылки = Дата(1, 1, 1), ТекущаяДатаСеанса(), ДатаРассылки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает статус для объекта документа
//
// Параметры:
//	НовыйСтатус - Строка - Имя статуса, который будет установлен у заказов
//	ДополнительныеПараметры - Структура - Структура дополнительных параметров установки статуса
//
// Возвращаемое значение:
//	Булево - Истина, в случае успешной установки нового статуса
//
Функция УстановитьСтатус(НовыйСтатус, ДополнительныеПараметры) Экспорт
	
	Статус = Перечисления.СтатусыРассылокКлиентам[НовыйСтатус];
	
	Возврат ПроверитьЗаполнение();
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.СтатусыРассылокКлиентам.Черновик;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
